---
kind: property
id: P:Autodesk.Revit.DB.PhaseArray.Item(System.Int32)
source: html/f806a5fa-35fa-7b0d-a66f-468889ac6451.htm
---
# Autodesk.Revit.DB.PhaseArray.Item Property

Gets or sets a phase at a specified index within the array.

## Syntax (C#)
```csharp
public virtual Phase this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the phase to be set or retrieved.

## Returns
Returns the phase at the specified index.